{
  "version": "1.0",
  "truncation": {
    "strategy": "LongestFirst",
    "max_length": 100,
    "stride": 0,
    "direction": "Right"
  },
  "padding": {
    "direction": "Right",
    "strategy": "BatchLongest",
    "pad_id": 0,
    "pad_token": "<pad>",
    "pad_type_id": 0
  },
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<pad>": 0,
      "#": 1,
      "%": 2,
      ")": 3,
      "(": 4,
      "+": 5,
      "-": 6,
      ".": 7,
      "1": 8,
      "0": 9,
      "3": 10,
      "2": 11,
      "5": 12,
      "4": 13,
      "7": 14,
      "6": 15,
      "9": 16,
      "8": 17,
      "=": 18,
      "A": 19,
      "C": 20,
      "B": 21,
      "E": 22,
      "D": 23,
      "G": 24,
      "F": 25,
      "I": 26,
      "H": 27,
      "K": 28,
      "M": 29,
      "L": 30,
      "O": 31,
      "N": 32,
      "P": 33,
      "S": 34,
      "R": 35,
      "U": 36,
      "T": 37,
      "W": 38,
      "V": 39,
      "Y": 40,
      "[": 41,
      "Z": 42,
      "]": 43,
      "_": 44,
      "a": 45,
      "c": 46,
      "b": 47,
      "e": 48,
      "d": 49,
      "g": 50,
      "f": 51,
      "i": 52,
      "h": 53,
      "m": 54,
      "l": 55,
      "o": 56,
      "n": 57,
      "s": 58,
      "r": 59,
      "u": 60,
      "t": 61,
      "y": 62
    },
    "merges": []
  }
}