{
  "version": "1.0",
  "truncation": {
    "strategy": "LongestFirst",
    "max_length": 100,
    "stride": 0,
    "direction": "Right"
  },
  "padding": {
    "direction": "Right",
    "strategy": "BatchLongest",
    "pad_id": 0,
    "pad_token": "<pad>",
    "pad_type_id": 0
  },
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<pad>": 0,
      "#": 29,
      "%": 30,
      ")": 31,
      "(": 1,
      "+": 32,
      "-": 33,
      "/": 34,
      ".": 2,
      "1": 35,
      "0": 3,
      "3": 36,
      "2": 4,
      "5": 37,
      "4": 5,
      "7": 38,
      "6": 6,
      "9": 39,
      "8": 7,
      "=": 40,
      "A": 41,
      "@": 8,
      "C": 42,
      "B": 9,
      "E": 43,
      "D": 10,
      "G": 44,
      "F": 11,
      "I": 45,
      "H": 12,
      "K": 46,
      "M": 47,
      "L": 13,
      "O": 48,
      "N": 14,
      "P": 15,
      "S": 49,
      "R": 16,
      "U": 50,
      "T": 17,
      "W": 51,
      "V": 18,
      "Y": 52,
      "[": 53,
      "Z": 19,
      "]": 54,
      "\\": 20,
      "a": 55,
      "c": 56,
      "b": 21,
      "e": 57,
      "d": 22,
      "g": 58,
      "f": 23,
      "i": 59,
      "h": 24,
      "m": 60,
      "l": 25,
      "o": 61,
      "n": 26,
      "s": 62,
      "r": 27,
      "u": 63,
      "t": 28,
      "y": 64
    },
    "merges": []
  }
}