{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "direction": "Right",
    "strategy": "BatchLongest",
    "pad_id": 0,
    "pad_token": "<pad>",
    "pad_type_id": 0
  },
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<pad>": 0,
      "A": 1,
      "C": 2,
      "B": 3,
      "E": 4,
      "D": 5,
      "G": 6,
      "F": 7,
      "I": 8,
      "H": 9,
      "K": 10,
      "M": 11,
      "L": 12,
      "O": 13,
      "N": 14,
      "Q": 15,
      "P": 16,
      "S": 17,
      "R": 18,
      "U": 19,
      "T": 20,
      "W": 21,
      "V": 22,
      "Y": 23,
      "X": 24,
      "Z": 25
    },
    "merges": []
  }
}